<a href="https://colab.research.google.com/github/young950814/SPLIT-/blob/master/DSH_3(3).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [0]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [0]:
np.exp(ser) #indices are preseved in series

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [0]:
np.sin(df*np.pi/4) #indices are preserved in dataframes

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

In [0]:
area = pd.Series({'Alaska':1723337, 'Texas':695662,
                 'California':423967}, name='area')
population = pd.Series({'California':38332521, 'Texas':26448193,
                       'New York':19651127}, name='population')

In [0]:
population/area #union of indices

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [0]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [0]:
#missing values, or any item for which one or the other does not have an entry is marking with NaN
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [0]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [0]:
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

    A  B
0  18  6
1   8  6

In [0]:
B = pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('BAC'))
B

   B  A  C
0  1  3  8
1  1  9  8
2  9  4  1

In [0]:
A + B #indices are aligned, sorted

      A    B   C
0  21.0  7.0 NaN
1  17.0  7.0 NaN
2   NaN  NaN NaN

In [0]:
fill = A.stack().mean() #stacking?
A.add(B, fill_value=fill)

      A     B     C
0  21.0   7.0  17.5
1  17.0   7.0  17.5
2  13.5  18.5  10.5

In [0]:
A = rng.randint(10, size=(3,4))
A

array([[3, 6, 7, 2],
       [0, 3, 1, 7],
       [3, 1, 5, 5]])

In [0]:
A - A[0] #마치 이렇게 array에서 row를 빼듯이, series와 dataframe간의 연산이 가능하다.

array([[ 0,  0,  0,  0],
       [-3, -3, -6,  5],
       [ 0, -5, -2,  3]])

In [0]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -3 -3 -6  5
2  0 -5 -2  3

In [0]:
#이제 column의 연산

df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -3  0  1 -4
1 -3  0 -2  4
2  2  0  4  4

In [0]:
halfrow = df.iloc[0,::2] # 0행의 Q, S column을 뺀 것. 그러니깐 R T가 NaN이지
halfrow

Q    3
S    7
Name: 0, dtype: int64

In [0]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -3.0 NaN -6.0 NaN
2  0.0 NaN -2.0 NaN